tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "chezmoi"
brew "cloudflared"
brew "code-server"
brew "direnv"
brew "fnm"
brew "go"
brew "hurl"
brew "shfmt"
brew "starship"
brew "tokei"
brew "zellij"
brew "zsh"
cask "aerospace"
cask "claude"
cask "cursor"
cask "desktoppr"
cask "discord"
cask "font-aporetic"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sketchybar-app-font"
cask "gitkraken"
cask "hammerspoon"
cask "microsoft-auto-update"
cask "microsoft-onenote"
cask "microsoft-teams"
cask "obsidian"
cask "raycast"
cask "slack"
cask "telegram-desktop"
cask "visual-studio-code"
cask "warp"
cask "ytmdesktop-youtube-music"
vscode "anthropic.claude-code"
vscode "arrterian.nix-env-selector"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bodil.file-browser"
vscode "bufbuild.vscode-buf"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dhall.dhall-lang"
vscode "dhall.vscode-dhall-lsp-server"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "haskell.haskell"
vscode "icrawl.discord-vscode"
vscode "ionide.ionide-fsharp"
vscode "jacobdufault.fuzzy-search"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "james-yu.latex-workshop"
vscode "jnoortheen.nix-ide"
vscode "justusadam.language-haskell"
vscode "kahole.magit"
vscode "kbysiec.vscode-search-everywhere"
vscode "lunaryorn.hlint"
vscode "mikestead.dotenv"
vscode "mkhl.direnv"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "orta.vscode-jest"
vscode "pinage404.nix-extension-pack"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "s0kil.vscode-hsx"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "xyc.vscode-mdx-preview"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
