tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "th-ch/youtube-music"
brew "chezmoi"
brew "cloudflared"
brew "code-server"
brew "coreutils"
brew "direnv"
brew "fd"
brew "fnm"
brew "git"
brew "go"
brew "golangci-lint"
brew "hurl"
brew "lazygit"
brew "neovim"
brew "poppler"
brew "ripgrep"
brew "shfmt"
brew "starship"
brew "tokei"
brew "zellij"
brew "zsh"
cask "aerospace"
cask "claude"
cask "cursor"
cask "desktoppr"
cask "discord"
cask "font-aporetic"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sketchybar-app-font"
cask "gitkraken"
cask "hammerspoon"
cask "microsoft-auto-update"
cask "microsoft-onenote"
cask "microsoft-teams"
cask "ngrok"
cask "obsidian"
cask "raycast"
cask "slack"
cask "telegram-desktop"
cask "visual-studio-code"
cask "warp"
cask "youtube-music"
vscode "anthropic.claude-code"
vscode "bodil.file-browser"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "golang.go"
vscode "jacobdufault.fuzzy-search"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "kahole.magit"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
