tap "felixkratz/formulae"
tap "koekeishiya/formulae"
brew "chezmoi"
brew "direnv"
brew "dotnet"
brew "fnm"
brew "shfmt"
brew "starship"
brew "zsh"
cask "cursor"
cask "desktoppr"
cask "font-jetbrains-mono-nerd-font"
cask "font-sketchybar-app-font"
cask "ghostty"
cask "gitkraken"
cask "microsoft-auto-update"
cask "microsoft-onenote"
cask "microsoft-teams"
cask "raycast"
cask "slack"
cask "telegram-desktop"
cask "ytmdesktop-youtube-music"
vscode "anysphere.csharp"
vscode "arrterian.nix-env-selector"
vscode "bodil.file-browser"
vscode "catppuccin.catppuccin-vsc"
vscode "davidanson.vscode-markdownlint"
vscode "dhall.dhall-lang"
vscode "dhall.vscode-dhall-lsp-server"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "ionide.ionide-fsharp"
vscode "jacobdufault.fuzzy-search"
vscode "jnoortheen.nix-ide"
vscode "kahole.magit"
vscode "mkhl.direnv"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode.vscode-typescript-next"
vscode "muhammad-sammy.csharp"
vscode "pinage404.nix-extension-pack"
vscode "pkief.material-product-icons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "shan.code-settings-sync"
vscode "teabyii.ayu"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
